# Use CASH_OUT_Template customized Notebook Template

In [1]:
from fosforml.model_manager.snowflakesession import get_session
my_session = get_session()

# ATM Meta data

In [8]:
table_name = 'ATM_METADATA'

sf_df = my_session.sql("select * from {}".format(table_name))
df_atm  = sf_df.to_pandas()

In [9]:
df_atm.shape

(420, 6)

In [10]:
df_atm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 420 entries, 0 to 419
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ATM_ID        420 non-null    object
 1   MAX_CAPACITY  420 non-null    float64
 2   BANK_ID       420 non-null    int8
 3   STATE         420 non-null    object
 4   CREATED_BY    420 non-null    object
 5   CREATED_AT    420 non-null    datetime64[ns, America/Los_Angeles]
dtypes: datetime64[ns, America/Los_Angeles](1), float64(1), int8(1), object(3)
memory usage: 16.9+ KB

In [11]:
df_atm.describe()

       MAX_CAPACITY    BANK_ID
count  4.200000e+02  420.00000
mean   3.300000e+06    2.00000
std    3.845215e+05    0.81747
min    2.420000e+06    1.00000
25%    2.860000e+06    1.00000
50%    3.520000e+06    2.00000
75%    3.520000e+06    3.00000
max    3.740000e+06    3.00000

In [12]:
df_atm.head()

,ATM_ID,MAX_CAPACITY,BANK_ID,STATE,CREATED_BY,CREATED_AT
0,SPCN2020,2640000.0,1,Michigan,FDC_User,2024-05-28 02:30:46.282000-07:00
1,TBH00000303920,3520000.0,3,Minnesota,FDC_User,2024-05-28 02:30:46.282000-07:00
2,TBH00000303919,3520000.0,3,Hawaii,FDC_User,2024-05-28 02:30:46.282000-07:00
3,TBH00000303918,3520000.0,3,Utah,FDC_User,2024-05-28 02:30:46.282000-07:00
4,TBH00000303917,3520000.0,3,Oregon,FDC_User,2024-05-28 02:30:46.282000-07:00

In [13]:
df_atm.isnull().sum()

ATM_ID          0
MAX_CAPACITY    0
BANK_ID         0
STATE           0
CREATED_BY      0
CREATED_AT      0
dtype: int64

In [15]:
cols = ['ATM_ID','STATE']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_atm[col].nunique())

------------------------------------------------
ATM_ID  ->  420
------------------------------------------------
STATE  ->  50

# BANKS Meta data

In [16]:
# To read a specific dataset published from a snowflake connection
table_name = 'ATM_BANK_METADATA'

sf_df = my_session.sql("select * from {}".format(table_name))
df_bank  = sf_df.to_pandas()

In [17]:
df_bank.shape

(3, 4)

In [18]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   BANK_ID     3 non-null      int8
 1   BANK_NAME   3 non-null      object
 2   CREATED_BY  3 non-null      object
 3   CREATED_AT  3 non-null      datetime64[ns, America/Los_Angeles]
dtypes: datetime64[ns, America/Los_Angeles](1), int8(1), object(2)
memory usage: 203.0+ bytes

In [19]:
df_bank.describe()

       BANK_ID
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [20]:
df_bank.head()

   BANK_ID    BANK_NAME CREATED_BY                       CREATED_AT
0        1  Wells Fargo   FDC_User 2024-05-28 02:44:36.280000-07:00
1        2   BNY Mellon   FDC_User 2024-05-28 02:44:36.280000-07:00
2        3     Citibank   FDC_User 2024-05-28 02:44:36.280000-07:00

In [21]:
df_bank.isnull().sum()

BANK_ID       0
BANK_NAME     0
CREATED_BY    0
CREATED_AT    0
dtype: int64

In [22]:
cols = ['BANK_NAME']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_bank[col].nunique())

------------------------------------------------
BANK_NAME  ->  3

# DATE Metadata

In [24]:
# To read a specific dataset published from a snowflake connection
table_name = 'ATM_DATE_METADATA'

sf_df = my_session.sql("select * from {}".format(table_name))
df_date  = sf_df.to_pandas()

In [25]:
df_date.shape

(783, 5)

In [26]:
df_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 783 entries, 0 to 782
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   DATE        783 non-null    object
 1   WEEKDAY     783 non-null    object
 2   HOLIDAY     783 non-null    bool
 3   CREATED_BY  783 non-null    object
 4   CREATED_AT  783 non-null    datetime64[ns, America/Los_Angeles]
dtypes: bool(1), datetime64[ns, America/Los_Angeles](1), object(3)
memory usage: 25.4+ KB

In [27]:
df_date.describe()

,DATE,WEEKDAY,HOLIDAY,CREATED_BY,CREATED_AT
count,783,783,783,783,783
unique,783,2,2,1,NaN
top,2021-01-01,weekday,False,FDC_User,NaN
freq,1,559,751,783,NaN
mean,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.080999680-07:00
min,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.081000-07:00
25%,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.080999936-07:00
50%,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.080999936-07:00
75%,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.080999936-07:00
max,NaN,NaN,NaN,NaN,2024-05-28 02:37:17.081000-07:00

In [28]:
df_date.head()

         DATE  WEEKDAY  HOLIDAY CREATED_BY                       CREATED_AT
0  2021-01-01  weekend     True   FDC_User 2024-05-28 02:37:17.081000-07:00
1  2023-02-22  weekday    False   FDC_User 2024-05-28 02:37:17.081000-07:00
2  2023-02-21  weekday    False   FDC_User 2024-05-28 02:37:17.081000-07:00
3  2023-02-20  weekday     True   FDC_User 2024-05-28 02:37:17.081000-07:00
4  2023-02-19  weekday    False   FDC_User 2024-05-28 02:37:17.081000-07:00

In [29]:
df_date.isnull().sum()

DATE          0
WEEKDAY       0
HOLIDAY       0
CREATED_BY    0
CREATED_AT    0
dtype: int64

In [30]:
cols = ['DATE','WEEKDAY','HOLIDAY']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_date[col].nunique())

------------------------------------------------
DATE  ->  783
------------------------------------------------
WEEKDAY  ->  2
------------------------------------------------
HOLIDAY  ->  2

# TRANSACTION METADATA

In [31]:
# To read a specific dataset published from a snowflake connection
# To read a specific dataset published from a snowflake connection
table_name = 'ATM_TRANSACTION_METADATA'

sf_df = my_session.sql("select * from {}".format(table_name))
df_trans  = sf_df.to_pandas()

df_trans = snowflake.get_dataframe("ATM_TRANSACTION_METADATA")

In [32]:
df_trans.shape

(328860, 7)

In [33]:
df_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 328860 entries, 0 to 328859
Data columns (total 7 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   ATMID          328860 non-null  object
 1   DATE           328860 non-null  object
 2   DISPENSE       328860 non-null  float64
 3   DT             328860 non-null  float64
 4   COUNTTOTALTXN  328860 non-null  float64
 5   CREATED_BY     328860 non-null  object
 6   CREATED_AT     328860 non-null  datetime64[ns, America/Los_Angeles]
dtypes: datetime64[ns, America/Los_Angeles](1), float64(3), object(3)
memory usage: 17.6+ MB

In [34]:
df_trans.describe()

           DISPENSE             DT  COUNTTOTALTXN
count  3.288600e+05  328860.000000  328860.000000
mean   3.217324e+05     126.453506      83.735632
std    2.818005e+05     305.196984      71.546692
min    0.000000e+00       0.000000       0.000000
25%    7.227000e+04       0.000000      22.000000
50%    2.866500e+05       0.000000      78.000000
75%    4.904100e+05      37.000000     124.000000
max    1.936620e+06    1296.000000     504.000000

In [35]:
df_trans.head()

,ATMID,DATE,DISPENSE,DT,COUNTTOTALTXN,CREATED_BY,CREATED_AT
0,TBH000274025,2023-01-29,225180.0,0.0,90.0,FDC_User,2024-05-28 02:40:48.092000-07:00
1,TBH000274025,2023-01-30,262440.0,0.0,117.0,FDC_User,2024-05-28 02:40:48.092000-07:00
2,TBH000274025,2023-01-31,561150.0,0.0,160.0,FDC_User,2024-05-28 02:40:48.092000-07:00
3,TBH000274025,2023-02-01,437220.0,0.0,129.0,FDC_User,2024-05-28 02:40:48.092000-07:00
4,TBH000274025,2023-02-02,360900.0,0.0,119.0,FDC_User,2024-05-28 02:40:48.092000-07:00

In [36]:
df_trans.isnull().sum()

ATMID            0
DATE             0
DISPENSE         0
DT               0
COUNTTOTALTXN    0
CREATED_BY       0
CREATED_AT       0
dtype: int64

In [37]:
cols = ['ATMID','DATE','DISPENSE','DT','COUNTTOTALTXN']
for col in cols:
    print ("------------------------------------------------")
    print (col, " -> ",df_trans[col].nunique())

------------------------------------------------
ATMID  ->  420
------------------------------------------------
DATE  ->  783
------------------------------------------------
DISPENSE  ->  5497
------------------------------------------------
DT  ->  1022
------------------------------------------------
COUNTTOTALTXN  ->  381